package com.iflytek.cloud.resource;

/* loaded from: classes.dex */
public class a {
    public static String[] a = {"语音核心技术由 <a href=\"http://dev.voicecloud.cn/msc/help.html\">科大讯飞</a>提供 ", "http://dev.voicecloud.cn/msc/help.html", "知道了", "详细", "取消", "说完了", "设置", "更多", "重新说话", "重试", "录音回放", "重新获取结果", "1.请保持语速适中\n2.距离麦克风10厘米左右\n3.请在相对安静环境下使用\n4.一次可以说几句话哦", "1.请保持语速适中\n2.距离麦克风10厘米左右\n3.请在相对安静环境下使用\n"};
    public static String[] b = {"使用帮助", "正在连接服务器...", "倾听中", "识别中", "正在获取音频...", "错误码", "科大讯飞语音合成", "正在上传数据"};
    public static String[] c = {"", "没有检查到网络", "网络连接超时", "网络连接发生异常", "未设置有效权限", "无法解析的结果", "无法连接服务,请检查网络", "无效的参数", "发生未知错误", "启动录音失败", "没有匹配的结果", "您好像没有说话哦", "无法支持的编码格式", "无有效的文本信息", "无法读写文件", "播放音频错误", "内存不足", "文本过长", "用户校验失败", "网络繁忙，请稍候", "上传数据格式不正确", "未找到有效的语法文件", "无法找到本地资源", "无效的用户名", "密码错误", "未经授权的语音应用", "系统未安装浏览器，请安装后再查看", "引擎繁忙，请稍候", "引擎初始化失败", "组件未安装"};
    public static String[] d = {"错误码", "发生未知错误"};
}
