package com.iflytek.cloud.resource;

/* loaded from: classes.dex */
public class c {
    public static String[] a = {"Powered by <a href=\"http://dev.voicecloud.cn/msc/help.html\">iFLYTEK</a> ", "http://dev.voicecloud.cn/msc/help.html", "知道了", "詳細", "取消", "說完了", "設置", "更多", "重新說話", "重試", "錄音回放", "重新獲取結果", "1.請保持語速適中\n2.距離麥克風10釐米左右\n3.請在相對安靜環境下使用\n4.一次可以說幾句話哦", "1.請保持語速適中\n2.距離麥克風10釐米左右\n3.請在相對安靜環境下使用\n"};
    public static String[] b = {"使用幫助", "正在連接服務器...", "請說出內容", "正在獲取內容...", "正在獲取音頻...", "出錯", "科大訊飛語音合成", "正在上傳數據"};
    public static String[] c = {"", "沒有檢查到網絡", "網絡連接超時", "網絡連接發生異常", "未設置有效權限", "無法解析的結果", "無法連接服務，請檢查網絡", "無效的參數", "發生未知錯誤", "啟動錄音失敗", "沒有匹配的結果", "您好像沒有說話哦", "無法支持的編碼格式", "無有效的文本信息", "無法讀寫文件", "播放音頻錯誤", "內存不足", "文本過長", "用戶校驗失敗", "網絡繁忙，請稍後", "上傳數據格式不正確", "未找到有效的語法文件", "無法找到本地資源", "無效的用戶名", "密碼錯誤", "未經授權的語音應用", "系統未安裝瀏覽器，請安裝后再查看", "引擎繁忙，請稍候", "引擎初始化失敗", "組件未安裝"};
    public static String[] d = {"錯誤碼", "發生未知錯誤"};
}
